AixcelStudio/Aixcel_Mini_Power_Board/Aixcel_Mini_Power_Board_HW_Check/AT32F403ACGT7_IAR/Src/hwconf.c
    /* RTC interrupt Init */
    NVIC_SetPriority(RTC_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
    NVIC_EnableIRQ(RTC_IRQn);
    
    /* USART1 interrupt Init */
    NVIC_SetPriority(USART1_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
    NVIC_EnableIRQ(USART1_IRQn);
    
    /* USART3 interrupt Init */
    NVIC_SetPriority(USART3_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
    NVIC_EnableIRQ(USART3_IRQn);
    
    /* SPI2 interrupt Init */
    NVIC_SetPriority(SPI2_I2S2EXT_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
    NVIC_EnableIRQ(SPI2_I2S2EXT_IRQn);
    
    /* CAN1 interrupt Init */
  #ifdef CAN1_ENABLE
    NVIC_SetPriority(USB_HP_CAN1_TX_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
    NVIC_EnableIRQ(USB_HP_CAN1_TX_IRQn);
    NVIC_SetPriority(USB_LP_CAN1_RX0_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
    NVIC_EnableIRQ(USB_LP_CAN1_RX0_IRQn);
    NVIC_SetPriority(CAN1_RX1_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
    NVIC_EnableIRQ(CAN1_RX1_IRQn);
  #else
    NVIC_SetPriority(USB_HP_CAN1_TX_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
    NVIC_EnableIRQ(USB_HP_CAN1_TX_IRQn);
    NVIC_SetPriority(USB_LP_CAN1_RX0_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
    NVIC_EnableIRQ(USB_LP_CAN1_RX0_IRQn);
  #endif
    
    /* EXTI3 interrupt Init */
    NVIC_SetPriority(EXTI3_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
    NVIC_EnableIRQ(EXTI3_IRQn);
    
    /* EXTI5_9 interrupt Init */
    NVIC_SetPriority(EXTI9_5_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
    NVIC_EnableIRQ(EXTI9_5_IRQn);
}

void System_Misc_Init(void)
{
    ;
}

void exti_init(uint32_t EXTI_Line, EXTIMode_Type EXTI_Mode, EXTITrigger_Type EXTI_Trigger, FunctionalState EXTI_LineEnable)
{
    EXTI_InitType EXTI_InitStruct;
    
    EXTI_StructInit(&EXTI_InitStruct);
    EXTI_InitStruct.EXTI_Line = EXTI_Line;
    EXTI_InitStruct.EXTI_Mode = EXTI_Mode;
    EXTI_InitStruct.EXTI_Trigger = EXTI_Trigger;
    EXTI_InitStruct.EXTI_LineEnable = EXTI_LineEnable;
    
    EXTI_Init(&EXTI_InitStruct);
}

void System_EXTI_Init(void)
{
    /* connect key EXTI line to key GPIO pin */
    GPIO_EXTILineConfig(GPIO_PortSourceGPIOA, GPIO_PinsSource8);

    /* configure key EXTI line */
    exti_init(EXTI_Line8, EXTI_Mode_Interrupt, EXTI_Trigger_Falling, ENABLE);
    
    EXTI_ClearFlag(EXTI_Line8);
    
    
    /* connect key EXTI line to key GPIO pin */
    GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, GPIO_PinsSource3);

    /* configure key EXTI line */
    exti_init(EXTI_Line3, EXTI_Mode_Interrupt, EXTI_Trigger_Falling, ENABLE);
    
    EXTI_ClearFlag(EXTI_Line3);
}

/* AT32F4xxx DMA1 Channel Request List
 ************************************************************************************************************
 *Periphrial     Channel1      Channel2      Channel3      Channel4      Channel5      Channel6      Channel7
 *************************************************************************************************************
 *                                                        TIMER1_CH4
 *TIMER1                      TIMER1_CH1    TIMER1_CH2    TIMER1_TRIG   TIMER1_UP     TIMER1_CH3
 *                                                        TIMER1_COM
 *************************************************************************************************************
 *TIMER2        TIMER2_CH3    TIMER2_UP                                 TIMER2_CH1                  TIMER2_CH2
 *                                                                                                  TIMER2_CH3
 *************************************************************************************************************
 *TIMER3                      TIMER3_CH3    TIMER3_CH4                                TIMER3_CH1
 *                                          TIMER3_UP                                 TIMER3_TRIG
 *************************************************************************************************************
 *TIMER4        TIMER4_CH1                                TIMER4_CH2    TIMER4_CH3                  TIMER4_UP
 *************************************************************************************************************
 *ADC1          ADC1
 *************************************************************************************************************
 *SPI/I2S                 SPI1_RX/I2S1_RX SPI1_TX/I2S1_TX SPI2/I2S2_RX SPI2/I2S2_TX
 *************************************************************************************************************
 *USART                       USART3_TX     USART3_RX     USART1_TX     USART1_RX     USART2_RX     USART2_TX
 *************************************************************************************************************
 *I2C                         I2C3_TX       I2C3_RX       I2C2_TX       I2C2_RX       I2C1_TX       I2C1_RX
 *************************************************************************************************************
 */

/* AT32F4xxx DMA2 Channel Request List
 ************************************************************************************************************
 *Periphrial     Channel1      Channel2      Channel3      Channel4      Channel5      
 *************************************************************************************************************
 *TIMER5        TIMER5_CH4    TIMER5_CH3                  TIMER5_CH2    TIMER5_CH1
 *              TIMER5_TRIG   TIMER5_UP
 *************************************************************************************************************
 *TIMER6                                    TIMER6_UP                                
 *************************************************************************************************************
 *TIMER7                                                  TIMER6_UP                             
 *************************************************************************************************************
 *              TIMER8_CH3    TIMER8_CH4
 *TIMER8        TIMER8_UP     TIMER8_TRIG   TIMER8_CH1                  TIMER8_CH2
 *                            TIMER8_COM   
 *************************************************************************************************************
 *ADC2                                                                    ADC2
 *************************************************************************************************************
 *DAC                                        DAC_CH0       DAC_CH1
 *************************************************************************************************************
 *SPI/I2S     SPI2/I2S2_RX   SPI2/I2S2_TX     
 *************************************************************************************************************
 *UART4                                      UART4_RX                    UART4_TX       
 *************************************************************************************************************
 *SDIO                                                      SDIO  
 *************************************************************************************************************
 *SDIO2                                                                   SDIO2 
 *************************************************************************************************************
 */

void System_DMA_Init(void)
{
    /* DMA controller clock enable */
    RCC_AHBPeriphClockCmd(RCC_AHBPERIPH_DMA1, ENABLE);
    
    /* DMA interrupt init */
    /* DMA1_Channel1_IRQn interrupt configuration */
    NVIC_SetPriority(DMA1_Channel1_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
    NVIC_EnableIRQ(DMA1_Channel1_IRQn); 
    
    /* DMA1_Channel2_IRQn interrupt configuration */
    NVIC_SetPriority(DMA1_Channel2_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
    NVIC_EnableIRQ(DMA1_Channel2_IRQn); 
    
