AixcelStudio/Aixcel_Mini_Power_Board/Aixcel_Mini_Power_Board_HW_Check/AT32F403ACGT7_IAR/Src/hwconf.c
    /* DMA1_Channel3_IRQn interrupt configuration */ 
    NVIC_SetPriority(DMA1_Channel3_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
    NVIC_EnableIRQ(DMA1_Channel3_IRQn);
    
    /* DMA1_Channel4_IRQn interrupt configuration */
    NVIC_SetPriority(DMA1_Channel4_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
    NVIC_EnableIRQ(DMA1_Channel4_IRQn);
    
    /* DMA1_Channel5_IRQn interrupt configuration */
    NVIC_SetPriority(DMA1_Channel5_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
    NVIC_EnableIRQ(DMA1_Channel5_IRQn);
    
    /* DMA1_Channel6_IRQn interrupt configuration */
    NVIC_SetPriority(DMA1_Channel6_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
    NVIC_EnableIRQ(DMA1_Channel6_IRQn);
    
    /* DMA1_Channel7_IRQn interrupt configuration */
    NVIC_SetPriority(DMA1_Channel7_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
    NVIC_EnableIRQ(DMA1_Channel7_IRQn);
    
    
    /* DMA controller clock enable */
    RCC_AHBPeriphClockCmd(RCC_AHBPERIPH_DMA2, ENABLE);
    
    /* DMA2_Channel3_IRQn interrupt configuration */ 
    NVIC_SetPriority(DMA2_Channel3_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
    NVIC_EnableIRQ(DMA2_Channel3_IRQn);
}

void System_RTC_Init(void)
{
	/* Enable PWR and BKP clocks */
	RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_PWR | RCC_APB1PERIPH_BKP, ENABLE);

	/* Allow access to BKP Domain */
	PWR_BackupAccessCtrl(ENABLE); 

	/* Check Backup data registers is correct*/
	if (BKP_ReadBackupReg(BKP_DT1) != 0x5051)
	{
		/* Reset Backup Domain */
		BKP_Reset();
		
		/* Enable the LSI OSC */
		RCC_LSEConfig(RCC_LSE_ENABLE);
		/* Wait till LSI is ready */
		while(RCC_GetFlagStatus(RCC_FLAG_LSESTBL) == RESET);
		/* Select the RTC Clock Source */
		RCC_RTCCLKConfig(RCC_RTCCLKSelection_LSE);//if board has external 32.768KHz crystal but excute "RCC_RTCCLKConfig(RCC_RTCCLKSelection_LSI)" at here, RTC_WaitForSynchro() will fall in forever loop!!!
		
		/* Enable RTC Clock */
		RCC_RTCCLKCmd(ENABLE);
		/* Wait for RTC registers synchronization */
		RTC_WaitForSynchro();
		/* Wait until last write operation on RTC registers has finished */
		RTC_WaitForLastTask();
		
		/* Set RTC prescaler: set RTC period to 1sec */
		RTC_SetDIV(32767);
		/* Wait until last write operation on RTC registers has finished */
		RTC_WaitForLastTask();
		
		/* Set the RTC time */
		RTC_SetCounter(2000);
		/* Wait until last write operation on RTC registers has finished */
		RTC_WaitForLastTask();
		
		/* Writes data to Backup Register */
		BKP_WriteBackupReg(BKP_DT1, 0x5051);
	}
	else
	{
		/* Wait for RTC registers synchronization */
		RTC_WaitForSynchro();
		/* Wait until last write operation on RTC registers has finished */
		RTC_WaitForLastTask();
		/* Clear RTC pending flag */
		RTC_ClearFlag(RTC_FLAG_PACE);
		/* Wait until last write operation on RTC registers has finished */
		RTC_WaitForLastTask();
	}
}

#ifdef USART1_ENABLE
void System_USART1_Init(uint32_t baud_rate)
{
    /* enable GPIO clock */
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_GPIOA, ENABLE);

    /* enable USART clock */
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_USART1, ENABLE);

    /* connect port to USARTx_Tx */
    gpio_init(USART1_GPIO_Port, GPIO_Mode_AF_PP, GPIO_MaxSpeed_50MHz, USART1_Tx_Pin);

    /* connect port to USARTx_Rx */
    gpio_init(USART1_GPIO_Port, GPIO_Mode_IN_FLOATING, GPIO_MaxSpeed_50MHz, USART1_Rx_Pin);

    /* Deinitializes the USARTx peripheral */
    USART_Reset(USART1);

    /* USART configure */
    USART_InitType USART_InitStruct;
    
    USART_StructInit(&USART_InitStruct);
    USART_InitStruct.USART_BaudRate = baud_rate;
    USART_InitStruct.USART_Parity = USART_Parity_No;
    USART_InitStruct.USART_WordLength = USART_WordLength_8b;
    USART_InitStruct.USART_StopBits = USART_StopBits_1;
    USART_InitStruct.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
    USART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    
    USART_Init(USART1, &USART_InitStruct);
    
    USART_Cmd(USART1, ENABLE);
    
    USART_INTConfig(USART1, USART_INT_RDNE, ENABLE);
    
    /**************************************************************************/
  #if 0    
    /* USART1 DMA Config */
    DMA_InitType DMA_InitStruct;
    
    /* initialize DMA1 channel5 --> USART1 Rx */
    DMA_InitStruct.DMA_Direction = DMA_DIR_PERIPHERALSRC;
    DMA_InitStruct.DMA_MemoryBaseAddr = (uint32_t)USART1_Rx_Mem_Region;
    DMA_InitStruct.DMA_MemoryInc = DMA_MEMORYINC_ENABLE;
    DMA_InitStruct.DMA_MemoryDataWidth = DMA_MEMORYDATAWIDTH_BYTE;
    DMA_InitStruct.DMA_BufferSize = 0;
    DMA_InitStruct.DMA_PeripheralBaseAddr = USART1_BASE + 0x04U;
    DMA_InitStruct.DMA_PeripheralInc = DMA_PERIPHERALINC_DISABLE;
    DMA_InitStruct.DMA_PeripheralDataWidth = DMA_PERIPHERALDATAWIDTH_BYTE;
    DMA_InitStruct.DMA_Priority = DMA_PRIORITY_VERYHIGH;
    DMA_InitStruct.DMA_Mode = DMA_MODE_NORMAL;
    DMA_InitStruct.DMA_MTOM = DMA_MEMTOMEM_DISABLE;
    DMA_Init(DMA1_Channel5, &DMA_InitStruct);

    /* USART DMA enable for reception */
    USART_DMACmd(USART1, USART_DMAReq_Rx, ENABLE);
    
    /* enable DMA transfer complete interrupt */
    DMA_INTConfig(DMA1_Channel5, DMA_INT_TC, ENABLE);

    /* disable DMA1 channel5 */
    DMA_ChannelEnable(DMA1_Channel5, DISABLE);               //Caution: Not enable DMA_Channel during init process, Only enable DMA_Channel while receive/transmmit data using DMA !!!
        
    /* initialize DMA1 channel4 --> USART1 Tx */
    DMA_InitStruct.DMA_Direction = DMA_DIR_PERIPHERALDST;
    DMA_InitStruct.DMA_MemoryBaseAddr = (uint32_t)USART1_Tx_Mem_Region;
    DMA_InitStruct.DMA_MemoryInc = DMA_MEMORYINC_ENABLE;
    DMA_InitStruct.DMA_MemoryDataWidth = DMA_MEMORYDATAWIDTH_BYTE;
    DMA_InitStruct.DMA_BufferSize = 0;
    DMA_InitStruct.DMA_PeripheralBaseAddr = USART1_BASE + 0x04U;
    DMA_InitStruct.DMA_PeripheralInc = DMA_PERIPHERALINC_DISABLE;
    DMA_InitStruct.DMA_PeripheralDataWidth = DMA_PERIPHERALDATAWIDTH_BYTE;
    DMA_InitStruct.DMA_Priority = DMA_PRIORITY_VERYHIGH;
    DMA_InitStruct.DMA_Mode = DMA_MODE_NORMAL;
    DMA_InitStruct.DMA_MTOM = DMA_MEMTOMEM_DISABLE;
    DMA_Init(DMA1_Channel4, &DMA_InitStruct);

    /* USART DMA enable for transmission */
    USART_DMACmd(USART1, USART_DMAReq_Tx, ENABLE);
    
    /* enable DMA transfer complete interrupt */
    DMA_INTConfig(DMA1_Channel4, DMA_INT_TC, ENABLE);
    
