AixcelStudio/Aixcel_Mini_Power_Board/Aixcel_Mini_Power_Board_HW_Check/AT32F403ACGT7_IAR/Src/hwconf.c
    /* disable DMA1 channel4 */
    DMA_ChannelEnable(DMA1_Channel4, DISABLE);               //Caution: Not enable DMA_Channel during init process, Only enable DMA_Channel while receive/transmmit data using DMA !!!
  #endif
}
#endif

#ifdef USART2_ENABLE
void System_USART2_Init(uint32_t baud_rate)
{
    /* enable GPIO clock */
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_GPIOA, ENABLE);

    /* enable USART clock */
    RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_USART2, ENABLE);

    /* connect port to USARTx_Tx */
    gpio_init(USART2_GPIO_Port, GPIO_Mode_AF_PP, GPIO_MaxSpeed_50MHz, USART2_Tx_Pin);

    /* connect port to USARTx_Rx */
    gpio_init(USART2_GPIO_Port, GPIO_Mode_IN_FLOATING, GPIO_MaxSpeed_50MHz, USART2_Rx_Pin);

    /* Deinitializes the USARTx peripheral */
    USART_Reset(USART2);

    /* USART configure */
    USART_InitType USART_InitStruct;
    
    USART_StructInit(&USART_InitStruct);
    USART_InitStruct.USART_BaudRate = baud_rate;
    USART_InitStruct.USART_Parity = USART_Parity_No;
    USART_InitStruct.USART_WordLength = USART_WordLength_8b;
    USART_InitStruct.USART_StopBits = USART_StopBits_1;
    USART_InitStruct.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
    USART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    
    USART_Init(USART2, &USART_InitStruct);
    
    USART_Cmd(USART2, ENABLE);
    
    USART_INTConfig(USART2, USART_INT_RDNE, ENABLE);
    
    /**************************************************************************/
  #if 0    
    /* USART2 DMA Config */
    DMA_InitType DMA_InitStruct;
    
    /* initialize DMA1 channel6 --> USART2 Rx */
    DMA_InitStruct.DMA_Direction = DMA_DIR_PERIPHERALSRC;
    DMA_InitStruct.DMA_MemoryBaseAddr = (uint32_t)USART2_Rx_Mem_Region;
    DMA_InitStruct.DMA_MemoryInc = DMA_MEMORYINC_ENABLE;
    DMA_InitStruct.DMA_MemoryDataWidth = DMA_MEMORYDATAWIDTH_BYTE;
    DMA_InitStruct.DMA_BufferSize = 0;
    DMA_InitStruct.DMA_PeripheralBaseAddr = USART2_BASE + 0x04U;
    DMA_InitStruct.DMA_PeripheralInc = DMA_PERIPHERALINC_DISABLE;
    DMA_InitStruct.DMA_PeripheralDataWidth = DMA_PERIPHERALDATAWIDTH_BYTE;
    DMA_InitStruct.DMA_Priority = DMA_PRIORITY_VERYHIGH;
    DMA_InitStruct.DMA_Mode = DMA_MODE_NORMAL;
    DMA_InitStruct.DMA_MTOM = DMA_MEMTOMEM_DISABLE;
    DMA_Init(DMA1_Channel6, &DMA_InitStruct);

    /* USART DMA enable for reception */
    USART_DMACmd(USART2, USART_DMAReq_Rx, ENABLE);
    
    /* enable DMA transfer complete interrupt */
    DMA_INTConfig(DMA1_Channel6, DMA_INT_TC, ENABLE);
    
    /* disable DMA1 channel6 */
    DMA_ChannelEnable(DMA1_Channel6, DISABLE);               //Caution: Not enable DMA_Channel during init process, Only enable DMA_Channel while receive/transmmit data using DMA !!!
    
    /* initialize DMA1 channel7 --> USART2 Tx */
    DMA_InitStruct.DMA_Direction = DMA_DIR_PERIPHERALDST;
    DMA_InitStruct.DMA_MemoryBaseAddr = (uint32_t)USART2_Tx_Mem_Region;
    DMA_InitStruct.DMA_MemoryInc = DMA_MEMORYINC_ENABLE;
    DMA_InitStruct.DMA_MemoryDataWidth = DMA_MEMORYDATAWIDTH_BYTE;
    DMA_InitStruct.DMA_BufferSize = 0;
    DMA_InitStruct.DMA_PeripheralBaseAddr = USART2_BASE + 0x04U;
    DMA_InitStruct.DMA_PeripheralInc = DMA_PERIPHERALINC_DISABLE;
    DMA_InitStruct.DMA_PeripheralDataWidth = DMA_PERIPHERALDATAWIDTH_BYTE;
    DMA_InitStruct.DMA_Priority = DMA_PRIORITY_VERYHIGH;
    DMA_InitStruct.DMA_Mode = DMA_MODE_NORMAL;
    DMA_InitStruct.DMA_MTOM = DMA_MEMTOMEM_DISABLE;
    DMA_Init(DMA1_Channel7, &DMA_InitStruct);

    /* USART DMA enable for transmission */
    USART_DMACmd(USART2, USART_DMAReq_Tx, ENABLE);
    
    /* enable DMA transfer complete interrupt */
    DMA_INTConfig(DMA1_Channel7, DMA_INT_TC, ENABLE);
    
    /* disable DMA1 channel7 */
    DMA_ChannelEnable(DMA1_Channel7, DISABLE);               //Caution: Not enable DMA_Channel during init process, Only enable DMA_Channel while receive/transmmit data using DMA !!!
  #endif
}
#endif

#ifdef USART3_ENABLE
void System_USART3_Init(uint32_t baud_rate)
{
    /* enable GPIO clock */
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_GPIOB, ENABLE);

    /* enable USART clock */
    RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_USART3, ENABLE);

    /* connect port to USARTx_Tx */
    gpio_init(USART3_GPIO_Port, GPIO_Mode_AF_PP, GPIO_MaxSpeed_50MHz, USART3_Tx_Pin);

    /* connect port to USARTx_Rx */
    gpio_init(USART3_GPIO_Port, GPIO_Mode_IN_FLOATING, GPIO_MaxSpeed_50MHz, USART3_Rx_Pin);

    /* Deinitializes the USARTx peripheral */
    USART_Reset(USART3);
    
    /* USART configure */
    USART_InitType USART_InitStruct;
    
    USART_StructInit(&USART_InitStruct);
    USART_InitStruct.USART_BaudRate = baud_rate;
    USART_InitStruct.USART_Parity = USART_Parity_No;
    USART_InitStruct.USART_WordLength = USART_WordLength_8b;
    USART_InitStruct.USART_StopBits = USART_StopBits_1;
    USART_InitStruct.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
    USART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    
    USART_Init(USART3, &USART_InitStruct);
    
    USART_Cmd(USART3, ENABLE);
    
    USART_INTConfig(USART3, USART_INT_RDNE, ENABLE);
    
    /**************************************************************************/
  #if 0    
    /* USART3 DMA Config */
    DMA_InitType DMA_InitStruct;
    
    /* initialize DMA1 channel3 --> USART3 Rx */
    DMA_InitStruct.DMA_Direction = DMA_DIR_PERIPHERALSRC;
    DMA_InitStruct.DMA_MemoryBaseAddr = (uint32_t)USART3_Rx_Mem_Region;
    DMA_InitStruct.DMA_MemoryInc = DMA_MEMORYINC_ENABLE;
    DMA_InitStruct.DMA_MemoryDataWidth = DMA_MEMORYDATAWIDTH_BYTE;
    DMA_InitStruct.DMA_BufferSize = 0;
    DMA_InitStruct.DMA_PeripheralBaseAddr = USART3_BASE + 0x04U;
    DMA_InitStruct.DMA_PeripheralInc = DMA_PERIPHERALINC_DISABLE;
    DMA_InitStruct.DMA_PeripheralDataWidth = DMA_PERIPHERALDATAWIDTH_BYTE;
    DMA_InitStruct.DMA_Priority = DMA_PRIORITY_VERYHIGH;
    DMA_InitStruct.DMA_Mode = DMA_MODE_NORMAL;
    DMA_InitStruct.DMA_MTOM = DMA_MEMTOMEM_DISABLE;
    DMA_Init(DMA1_Channel3, &DMA_InitStruct);

    /* USART DMA enable for reception */
    USART_DMACmd(USART3, USART_DMAReq_Rx, ENABLE);
    
    /* enable DMA transfer complete interrupt */
    DMA_INTConfig(DMA1_Channel3, DMA_INT_TC, ENABLE);
    
    /* disable DMA1 channel3 */
    DMA_ChannelEnable(DMA1_Channel3, DISABLE);               //Caution: Not enable DMA_Channel during init process, Only enable DMA_Channel while receive/transmmit data using DMA !!!
    
    /* initialize DMA1 channel2 --> USART3 Tx */
    DMA_InitStruct.DMA_Direction = DMA_DIR_PERIPHERALDST;
    DMA_InitStruct.DMA_MemoryBaseAddr = (uint32_t)USART3_Tx_Mem_Region;
    DMA_InitStruct.DMA_MemoryInc = DMA_MEMORYINC_ENABLE;
    DMA_InitStruct.DMA_MemoryDataWidth = DMA_MEMORYDATAWIDTH_BYTE;
    DMA_InitStruct.DMA_BufferSize = 0;
    DMA_InitStruct.DMA_PeripheralBaseAddr = USART3_BASE + 0x04U;
    DMA_InitStruct.DMA_PeripheralInc = DMA_PERIPHERALINC_DISABLE;
    DMA_InitStruct.DMA_PeripheralDataWidth = DMA_PERIPHERALDATAWIDTH_BYTE;
    DMA_InitStruct.DMA_Priority = DMA_PRIORITY_VERYHIGH;
    DMA_InitStruct.DMA_Mode = DMA_MODE_NORMAL;
    DMA_InitStruct.DMA_MTOM = DMA_MEMTOMEM_DISABLE;
    DMA_Init(DMA1_Channel2, &DMA_InitStruct);

    /* USART DMA enable for transmission */
    USART_DMACmd(USART3, USART_DMAReq_Tx, ENABLE);
    
    /* enable DMA transfer complete interrupt */
    DMA_INTConfig(DMA1_Channel2, DMA_INT_TC, ENABLE);
    
