AixcelStudio/Aixcel_Mini_Power_Board/Aixcel_Mini_Power_Board_HW_Check/AT32F403ACGT7_IAR/Src/hwconf.c
    RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_TMR3, ENABLE);
    
    /* 
     * TIMER3_REMAP [1:0]
     * 00: 没有重映射(TIMER3_CH0/PA6，TIMER3_CH1/PA7，TIMER3_CH2/PB0，TIMER3_CH3/PB1)
     * 01: 没有使用
     * 10: 部分重映射(TIMER3_CH0/PB4，TIMER3_CH1/PB5，TIMER3_CH2/PB0，TIMER3_CH3/PB1)
     * 11: 完全重映射(TIMER3_CH0/PC6，TIMER3_CH1/PC7，TIMER3_CH2/PC8，TIMER3_CH3/PC9)
     */
    GPIO_PinsRemapConfig(AFIO_MAP4_TMR3_0010, ENABLE);
    
    gpio_init(VBAT_EN_GPIO_Port, GPIO_Mode_AF_PP, GPIO_MaxSpeed_50MHz, VBAT_EN_Pin);
    gpio_init(CHG_EN_GPIO_Port, GPIO_Mode_AF_PP, GPIO_MaxSpeed_50MHz, CHG_EN_Pin);
    
    TMR_Reset(TMR3);
    
    /* TIMER3 configuration */
    TMR_TimeBaseInitStruct.TMR_DIV               = 1;
    TMR_TimeBaseInitStruct.TMR_Period            = 600-1;
    TMR_TimeBaseInitStruct.TMR_ClockDivision     = TMR_CKD_DIV1;
    TMR_TimeBaseInitStruct.TMR_RepetitionCounter = 0;
    
    TMR_TimeBaseInit(TMR3, &TMR_TimeBaseInitStruct);
    
    TMR_CounterModeConfig(TMR3, TMR_CounterDIR_Up);

    /* CH4 configuration in PWM mode1, duty cycle (pwm)/600 */
    TMR_OCInitStruct.TMR_OCMode       = TMR_OCMode_PWM1;
    TMR_OCInitStruct.TMR_OutputState  = TMR_OutputState_Enable;
    TMR_OCInitStruct.TMR_OutputNState = TMR_OutputNState_Disable;
    TMR_OCInitStruct.TMR_Pulse        = 300;
    TMR_OCInitStruct.TMR_OCPolarity   = TMR_OCPolarity_High;
    TMR_OCInitStruct.TMR_OCNPolarity  = TMR_OCNPolarity_High;
    TMR_OCInitStruct.TMR_OCIdleState  = TMR_OCIdleState_Reset;
    TMR_OCInitStruct.TMR_OCNIdleState = TMR_OCNIdleState_Reset;
    
    TMR_OC1Init(TMR3, &TMR_OCInitStruct);
    TMR_OC2Init(TMR3, &TMR_OCInitStruct);
    
    TMR_OC1PreloadConfig(TMR3, TMR_OCPreload_Enable);
    TMR_OC2PreloadConfig(TMR3, TMR_OCPreload_Enable);

    /* auto-reload preload enable */
    TMR_ARPreloadConfig(TMR3, ENABLE);
    /* TMR3 enable */
    TMR_Cmd(TMR3, ENABLE);
}
#endif

#ifdef TIM6_ENABLE
void System_TMR6_Init(void)
{
    /* For AT32F4xx TIMER2,3,4,5,6,7,12,13,14 is at APB1(APB1_Fmax = 120MHz while CK_AHB = 240MHz & APB1 prescale = 2), 
     * but if(APB1 prescale = 1) CK_TIMERx = APB1, else CK_TIMERx = APB1*2, while APB1 = 120MHZ then CK_TIMERx = 240MHz,
     * if TIMER6's prescaler = 0x01, then TIMER6's clock is 240MHz/(0x01+1)=120MHz
     */
    RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_TMR6, ENABLE);
    
    TMR_Reset(TMR6);
    
    TMR_DIVConfig(TMR6, 0x01, TMR_DIVReloadMode_Update); 
    
    TMR_SetAutoreload(TMR6, 7);
    
    TMR_SelectOutputTrigger(TMR6, TMR_TRGOSource_Update);
    
    TMR_Cmd(TMR6, ENABLE);
}
#endif

#ifdef DAC_OUT1_ENABLE

/* Sine Wave Data Number */
#define SINE_POINT_NUM 32

/******************************Sine Wave Data***********************************/
const uint16_t SineWave12bit[SINE_POINT_NUM] = {
        2048,    2460,    2856,    3218,    3532,    3786,    3969,    4072,
        4093,    4031,    3887,    3668,    3382,    3042,    2661,    2255, 
        1841,    1435,    1054,     714,     428,     209,      65,       3,
          24,     127,     310,     564,     878,    1240,    1636,    2048
};

void System_DAC_OUT1_Init(void)
{
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_GPIOA, ENABLE);
    
    RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_DAC, ENABLE);
    
    /* once enabled the DAC, the corresponding GPIO pin is connected to the DAC converter automatically */
    gpio_init(GPIOA, GPIO_Mode_IN_ANALOG, GPIO_MaxSpeed_50MHz, GPIO_Pins_4);
    
    DAC_Reset();
    
    /* configure the DAC0 */
    DAC_InitType DAC_InitStruct;
    
    DAC_InitStruct.DAC_Trigger = DAC_Trigger_TMR6_TRGO;
    DAC_InitStruct.DAC_WaveGeneration = DAC_WaveGeneration_None;
    DAC_InitStruct.DAC_OutputBuffer = DAC_OutputBuffer_Enable;
      
    DAC_Init(DAC_Channel_1, &DAC_InitStruct);
    
    /* enable DAC1 and DMA for DAC1 */    
    DAC_Ctrl(DAC_Channel_1, ENABLE);
    DAC_DMACtrl(DAC_Channel_1, ENABLE);
    
    /**************************************************************************/
    
    /* DAC OUT1 DMA Config */
    DMA_InitType DMA_InitStruct;
    
    /* clear all the interrupt flags */
    DMA_ClearFlag(DMA2_FLAG_GL3);
    DMA_ClearFlag(DMA2_FLAG_TC3);
    DMA_ClearFlag(DMA2_FLAG_HT3);
    DMA_ClearFlag(DMA2_FLAG_ERR3);
    
    /* configure the DMA1 channel 3 */
    DMA_InitStruct.DMA_Direction = DMA_DIR_PERIPHERALDST;
    DMA_InitStruct.DMA_MemoryBaseAddr = (uint32_t)SineWave12bit;
    DMA_InitStruct.DMA_MemoryInc = DMA_MEMORYINC_ENABLE;
    DMA_InitStruct.DMA_MemoryDataWidth = DMA_MEMORYDATAWIDTH_HALFWORD;
    DMA_InitStruct.DMA_BufferSize = SINE_POINT_NUM-1;         //The one phrase's end is connected with the next's start, so minus 1!!!
    DMA_InitStruct.DMA_PeripheralBaseAddr = (uint32_t)&(DAC->HDR12R1);
    DMA_InitStruct.DMA_PeripheralInc = DMA_PERIPHERALINC_DISABLE;
    DMA_InitStruct.DMA_PeripheralDataWidth = DMA_PERIPHERALDATAWIDTH_HALFWORD;
    DMA_InitStruct.DMA_Priority = DMA_PRIORITY_VERYHIGH;
    DMA_InitStruct.DMA_Mode = DMA_MODE_CIRCULAR;
    DMA_InitStruct.DMA_MTOM = DMA_MEMTOMEM_DISABLE;
    DMA_Init(DMA2_Channel3, &DMA_InitStruct);
    
    /* enable DMA transfer complete interrupt */
    DMA_INTConfig(DMA2_Channel3, DMA_INT_TC, ENABLE);
    
    DMA_ChannelEnable(DMA2_Channel3, DISABLE);               //Caution: Not enable DMA_Channel during init process, Only enable DMA_Channel while receive/transmmit data using DMA !!!
}
#endif

#ifdef ADC1_ENABLE
void System_ADC1_Init(void)
{
    /* enable GPIOA clock */
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_GPIOA, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_GPIOB, ENABLE);
    
    /* enable ADC clock */
    RCC_APB2PeriphClockCmd(RCC_APB2PERIPH_ADC1, ENABLE);
    
    /* config ADC clock */
    RCC_ADCCLKConfig(RCC_APB2CLK_Div8);
    
    /* config the GPIO as analog mode */
    gpio_init(U_PWR_I_GPIO_Port, GPIO_Mode_IN_ANALOG, GPIO_MaxSpeed_50MHz, U_PWR_I_Pin);
    gpio_init(M_PWR_I_GPIO_Port, GPIO_Mode_IN_ANALOG, GPIO_MaxSpeed_50MHz, M_PWR_I_Pin);
    gpio_init(U_PWR_V_GPIO_Port, GPIO_Mode_IN_ANALOG, GPIO_MaxSpeed_50MHz, U_PWR_V_Pin);
    gpio_init(M_PWR_V_GPIO_Port, GPIO_Mode_IN_ANALOG, GPIO_MaxSpeed_50MHz, M_PWR_V_Pin);
    
    gpio_init(BAT_OUT_V_GPIO_Port, GPIO_Mode_IN_ANALOG, GPIO_MaxSpeed_50MHz, BAT_OUT_V_Pin);
    gpio_init(BAT_OUT_I_GPIO_Port, GPIO_Mode_IN_ANALOG, GPIO_MaxSpeed_50MHz, BAT_OUT_I_Pin);
    gpio_init(BAT_CHG_V_GPIO_Port, GPIO_Mode_IN_ANALOG, GPIO_MaxSpeed_50MHz, BAT_CHG_V_Pin);
    gpio_init(BAT_CHG_I_GPIO_Port, GPIO_Mode_IN_ANALOG, GPIO_MaxSpeed_50MHz, BAT_CHG_I_Pin);
    
    gpio_init(INPUT_CHG_V_GPIO_Port, GPIO_Mode_IN_ANALOG, GPIO_MaxSpeed_50MHz, INPUT_CHG_V_Pin);
    gpio_init(VCC_5V_I_GPIO_Port,    GPIO_Mode_IN_ANALOG, GPIO_MaxSpeed_50MHz, VCC_5V_I_Pin);
    
    ADC_InitType ADC_InitStruct;
    
    ADC_InitStruct.ADC_Mode = ADC_Mode_Independent;           /* ADC mode config */
    ADC_InitStruct.ADC_ContinuousMode = ENABLE;               /* ADC continuous function enable */
    ADC_InitStruct.ADC_ScanMode = ENABLE;                     /* ADC scan function enable */
    ADC_InitStruct.ADC_ExternalTrig = ADC_ExternalTrig_None;  /* ADC trigger config */
    ADC_InitStruct.ADC_NumOfChannel = ADC_Convertion_CNT;     /* ADC channel length config */
    ADC_InitStruct.ADC_DataAlign = ADC_DataAlign_Right;       /* ADC data alignment config */
    
    ADC_Init(ADC1, &ADC_InitStruct);
    
