AixcelStudio/Aixcel_Mini_Power_Board/Aixcel_Mini_Power_Board_HW_Check/AT32F403ACGT7_IAR/Src/hwconf.c
    /* enable CAN clock */
    RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_CAN1, ENABLE);
    
    gpio_init(CAN1_GPIO_Port, GPIO_Mode_IN_PU, GPIO_MaxSpeed_50MHz, CAN1_RX_Pin);
    gpio_init(CAN1_GPIO_Port, GPIO_Mode_AF_PP, GPIO_MaxSpeed_50MHz, CAN1_TX_Pin);
    
    /* 
     * CAN1_REMAP [1:0] 
     * 00: 没有重映射(CAN_RX/PA11, CAN_TX/PA12), 
     * 01: 没有使用, 
     * 10: 部分重映射(CAN_RX/PB8,  CAN_TX/PB9), 
     * 11: 完全重映射(CAN_RX/PD0,  CAN_TX/PD1),
     */
    //GPIO_PinsRemapConfig(GPIO_Remap1_CAN1, ENABLE);
    
    CAN_StructInit(&CAN_InitStruct);
        
    CAN_Reset(CAN1);
    
    Delay_ms(2);
    
    /* initialize CAN parameters */
    CAN_InitStruct.CAN_TTC = DISABLE;
    CAN_InitStruct.CAN_ABO = DISABLE;
    CAN_InitStruct.CAN_AWU = DISABLE;
    CAN_InitStruct.CAN_NART = DISABLE;
    CAN_InitStruct.CAN_RFL = DISABLE;
    CAN_InitStruct.CAN_TFP = DISABLE;
    CAN_InitStruct.CAN_Mode = CAN_Mode_Normal;
    
    switch(baudrate)
    {
        case CAN_BAUDRATE_5K:
            CAN_InitStruct.CAN_Prescaler = 2400;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        case CAN_BAUDRATE_10K:
            CAN_InitStruct.CAN_Prescaler = 1200;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        case CAN_BAUDRATE_20K:
            CAN_InitStruct.CAN_Prescaler = 600;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
            break;
        case CAN_BAUDRATE_50K:
            CAN_InitStruct.CAN_Prescaler = 240;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        case CAN_BAUDRATE_100K:
            CAN_InitStruct.CAN_Prescaler = 120;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        case CAN_BAUDRATE_125K:
            CAN_InitStruct.CAN_Prescaler = 96;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        case CAN_BAUDRATE_250K:
            CAN_InitStruct.CAN_Prescaler = 48;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        case CAN_BAUDRATE_500K:
            CAN_InitStruct.CAN_Prescaler = 24;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        case CAN_BAUDRATE_600K:
            CAN_InitStruct.CAN_Prescaler = 20;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        case CAN_BAUDRATE_750K:
            CAN_InitStruct.CAN_Prescaler = 16;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        case CAN_BAUDRATE_800K:
            CAN_InitStruct.CAN_Prescaler = 12;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_8tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_3tq;
            break;
        case CAN_BAUDRATE_1M:        
            CAN_InitStruct.CAN_Prescaler = 12;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        default:
            CAN_InitStruct.CAN_Prescaler = 12;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
    }
    
    /* initialize CAN */
    CAN_Init(CAN1, &CAN_InitStruct);
}
#endif

#ifdef CAN2_ENABLE
void System_CAN2_Init(CAN_Baudrate_Typedef baudrate)
{
    CAN_InitType CAN_InitStruct;
    
    /* enable CAN clock */
    RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_CAN2, ENABLE);
    
    gpio_init(CAN2_GPIO_Port, GPIO_Mode_IN_PU, GPIO_MaxSpeed_50MHz, CAN2_RX_Pin);
    gpio_init(CAN2_GPIO_Port, GPIO_Mode_AF_PP, GPIO_MaxSpeed_50MHz, CAN2_TX_Pin);
    
    /* 
     * CAN2_REMAP 
     * 0: 没有重映射(CAN_RX/PB12, CAN_TX/PB13), 
     * 1: 重映射(CAN_RX/PB5,  CAN_TX/PB6),
     */
    GPIO_PinsRemapConfig(GPIO_Remap_CAN2, ENABLE);
    
    CAN_StructInit(&CAN_InitStruct);
    
    CAN_Reset(CAN2);
    
    Delay_ms(2);
    
    /* initialize CAN parameters */
    CAN_InitStruct.CAN_TTC = DISABLE;
    CAN_InitStruct.CAN_ABO = DISABLE;
    CAN_InitStruct.CAN_AWU = DISABLE;
    CAN_InitStruct.CAN_NART = DISABLE;
    CAN_InitStruct.CAN_RFL = DISABLE;
    CAN_InitStruct.CAN_TFP = DISABLE;
    CAN_InitStruct.CAN_Mode = CAN_Mode_Normal;
    
    switch(baudrate)
    {
        case CAN_BAUDRATE_5K:
            CAN_InitStruct.CAN_Prescaler = 2400;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        case CAN_BAUDRATE_10K:
            CAN_InitStruct.CAN_Prescaler = 1200;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        case CAN_BAUDRATE_20K:
            CAN_InitStruct.CAN_Prescaler = 600;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
            break;
        case CAN_BAUDRATE_50K:
            CAN_InitStruct.CAN_Prescaler = 240;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        case CAN_BAUDRATE_100K:
            CAN_InitStruct.CAN_Prescaler = 120;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        case CAN_BAUDRATE_125K:
            CAN_InitStruct.CAN_Prescaler = 96;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        case CAN_BAUDRATE_250K:
            CAN_InitStruct.CAN_Prescaler = 48;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        case CAN_BAUDRATE_500K:
            CAN_InitStruct.CAN_Prescaler = 24;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        case CAN_BAUDRATE_600K:
            CAN_InitStruct.CAN_Prescaler = 20;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        case CAN_BAUDRATE_750K:
            CAN_InitStruct.CAN_Prescaler = 16;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        case CAN_BAUDRATE_800K:
            CAN_InitStruct.CAN_Prescaler = 12;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_8tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_3tq;
            break;
        case CAN_BAUDRATE_1M:        
            CAN_InitStruct.CAN_Prescaler = 12;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
        default:
            CAN_InitStruct.CAN_Prescaler = 12;
            CAN_InitStruct.CAN_SJW = CAN_SJW_2tq;
            CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
            CAN_InitStruct.CAN_BS2 = CAN_BS2_4tq;
            break;
    }
    
    /* initialize CAN */
    CAN_Init(CAN2, &CAN_InitStruct);
}
#endif

uint8_t System_CAN_Start(CAN_Type* can_periph)
{
  #ifdef CAN1_ENABLE 
    CAN_INTConfig(CAN1, CAN_INT_RFP0, ENABLE);        /*!< Enable FIFO 0 message pending interrupt */
    CAN_INTConfig(CAN1, CAN_INT_RFFU0, ENABLE);       /*!< Enable FIFO 0 full interrupt            */
    CAN_INTConfig(CAN1, CAN_INT_RFOV0, ENABLE);       /*!< Enable FIFO 0 overrun interrupt         */
    CAN_INTConfig(CAN1, CAN_INT_RFP1, ENABLE);        /*!< Enable FIFO 1 message pending interrupt */
    CAN_INTConfig(CAN1, CAN_INT_RFFU1, ENABLE);       /*!< Enable FIFO 1 full interrupt            */
    CAN_INTConfig(CAN1, CAN_INT_RFOV1, ENABLE);       /*!< Enable FIFO 1 overrun interrupt         */
  #endif
    
  #ifdef CAN2_ENABLE                                //Caution: STM32F10x has no CAN2!!!
    CAN_INTConfig(CAN2, CAN_INT_RFP0, ENABLE);        /*!< Enable FIFO 0 message pending interrupt */
    CAN_INTConfig(CAN2, CAN_INT_RFFU0, ENABLE);       /*!< Enable FIFO 0 full interrupt            */
    CAN_INTConfig(CAN2, CAN_INT_RFOV0, ENABLE);       /*!< Enable FIFO 0 overrun interrupt         */
    CAN_INTConfig(CAN2, CAN_INT_RFP1, ENABLE);        /*!< Enable FIFO 1 message pending interrupt */
    CAN_INTConfig(CAN2, CAN_INT_RFFU1, ENABLE);       /*!< Enable FIFO 1 full interrupt            */
    CAN_INTConfig(CAN2, CAN_INT_RFOV1, ENABLE);       /*!< Enable FIFO 1 overrun interrupt         */
  #endif
    
